In [2]:
import pandas as pd

print(pd.__version__)

1.2.5

In [6]:
data = {
    'col1':['1','2','3','teks'],
    'col2':['1','2','3','4']
}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [7]:
df.dtypes
# Keduanya bertipe data object karena nilainya adalah string

col1    object
col2    object
dtype: object

In [12]:
#Merubah tipe data dari col2 menjadi float 
df_x = df.astype({'col2':'float'})
df_x

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [13]:
df_x.dtypes

col1     object
col2    float64
dtype: object

In [16]:
# Merubah smua data pada df menjadi numeric
# Yang tidak bisa jadi numeric akan berubah jadi Nan
# Hal ini digunakan dengan menambahkan paramter coerce
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4